Revit 2024 API
SymbolTypeId.Gal Property
 Symbol gal, indicating unit US gallons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId Gal { get; }
Visual Basic
Public Shared ReadOnly Property Gal As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Gal {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace